backend/app/controllers/posts_controller.rb

    def index
        render json: Post.where(parent_post_id: nil)
---
SELECT "posts".* FROM "posts" WHERE "posts"."parent_post_id" = ?  [["parent_post_id", 1]]

    def replies
        @replies = Post.where(parent_post_id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."parent_post_id" = ?  [["parent_post_id", 1]]

    def create
        # byebug
        @post = Post.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("user_id", "content", "parent_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "Hi you suck, maybe not "], ["parent_post_id", 5], ["created_at", "2020-12-01 20:28:45.458396"], ["updated_at", "2020-12-01 20:28:45.458396"]]

    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "echoes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["echoes", 1], ["updated_at", "2020-12-01 21:05:22.071283"], ["id", 1]]

    def geo
        posts = []
        the_user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]