backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bryce"], ["LIMIT", 1]]
---
    def create
        @new_user = JSON.parse(request.body)
        byebug
        render json: User.find_or_create_by(username: @new_user.username)