backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "bryce"], ["created_at", "2020-12-03 17:57:47.521025"], ["updated_at", "2020-12-03 17:57:47.521025"]]
---
    def create
        @new_user = User.find_or_create_by(user_params)